# Задача №17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

lst_1 = [1, 1, 2, 0, -1, 3, 4, 4]
lst_2 = []

for item in list:
    if item not in lst_2:
        lst_2.append(item)
print(lst_2)
print(len(lst_2))
 
# lst_1 = [1, 1, 2, 0, -1, 3, 4, 4]
# lst_2 = set(lst_1)
# print(len(lst_2))