# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop()) # убрать из списка 0  
# print(list_1) # вывод списка бeз 0 [12, 7, -1, 21]
# print(list_1.pop()) # убрать из списка 21  
# print(list_1) # вывод списка бeз 21 [12, 7, -1]
# print(list_1.pop()) # убрать из списка -1  
# print(list_1) # вывод списка бeз -1 [12, 7]

# # удаление конкретного элемента из списка 
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop(0)) # убрать из списка 12  
# print(list_1) # вывод списка бeз 0 [7, -1, 21, 0]

# добавление элемента на конкретную позицию
list_1 = [12, 7, -1, 21, 0]
print(list_1.insert(2, 11)) # добавить на место индекса 2 - элемент 11  
print(list_1) # вывод списка бeз 0 [12, 7, 11, -1, 21, 0]
